{
  "var_def": {
    "CHARACTER": { "args": "LEN=len" },
    "CLASS": { "args": "name" },
    "COMPLEX": { "args": "KIND=kind" },
    "DOUBLE COMPLEX": { },
    "DOUBLE PRECISION": { },
    "INTEGER": { "args": "KIND=kind" },
    "LOGICAL": { "args": "KIND=kind" },
    "REAL": { "args": "KIND=kind" },
    "TYPE": { "args": "KIND=kind" }
  },
  "int_stmnts": {
    "ALLOCATE": {
      "doc": "Dynamically create storage for allocatable variables and pointer targets."
    },
    "CALL": {
      "doc": "Transfers control to a subroutine subprogram."
    },
    "CLOSE": {
      "doc": "Disconnect a file from a unit."
    },
    "CYCLE": {
      "doc": "Interrupt the current execution cycle of the innermost (or named) DO construct."
    },
    "DEALLOCATE": {
      "doc": "Free the storage allocated for allocatable variables and nonprocedure pointer targets (and causes the pointers to become disassociated)."
    },
    "FORMAT": {
      "doc": "Specify the form of data being transferred and the data conversion (editing) required to achieve that form."
    },
    "INQUIRE": {
      "doc": "Return information on the status of specified properties of a file, logical unit, or directory."
    },
    "NAMELIST": {
      "doc": "Associates a name with a list of variables. This group name can be referenced in some input/output operations."
    },
    "NULLIFY": {
      "doc": "Disassociate a pointer from a target."
    },
    "OPEN": {
      "doc": "Connect an external file to a unit, creates a new file and connects it to a unit, creates a preconnected file, or changes certain properties of a connection."
    },
    "READ": {
      "doc": "Transfer input data from external sequential, direct-access, or internal records."
    },
    "RETURN": {
      "doc": "Return control to the calling program unit."
    },
    "REWIND": {
      "doc": "Positions a sequential or direct access file at the beginning of the file (the initial point)."
    },
    "STOP": {
      "doc": "Terminate execution of the program."
    },
    "WRITE": {
      "doc": "Transfer output data to external sequential, direct-access, or internal records."
    }
  }
}
